{"url": "https://www.parsehub.com/sandbox/navmovies2", "movies":[{"title":"The Shawshank Redemption","plot":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","year":"1994"},{"title":"Schindler's List","plot":"In Poland during World War II, Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.","year":"1993"},{"title":"The Godfather","plot":"The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.","year":"1972"},{"title":"The Godfather: Part II","plot":"The early life and career of Vito Corleone in 1920s New York is portrayed while his son, Michael, expands and tightens his grip on his crime syndicate stretching from Lake Tahoe, Nevada to pre-revolution 1958 Cuba.","year":"1974"},{"title":"The Dark Knight","plot":"When Batman, Gordon and Harvey Dent launch an assault on the mob, they let the clown out of the box, the Joker, bent on turning Gotham on itself and bringing any heroes down to his level.","year":"2008"},{"title":"Pulp Fiction","plot":"The lives of two mob hit men, a boxer, a gangster's wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","year":"1994"},{"title":"The Good, the Bad and the Ugly","plot":"A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.","year":"1966"},{"title":"12 Angry Men","plot":"A dissenting juror in a murder trial slowly manages to convince the others that the case is not as obviously clear as it seemed in court.","year":"1957"},{"title":"The Lord of the Rings: The Return of the King","plot":"Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.","year":"2003"},{"title":"Fight Club","plot":"An insomniac office worker looking for a way to change his life crosses paths with a devil-may-care soap maker and they form an underground fight club that evolves into something much, much more...","year":"1999"},{"title":"The Lord of the Rings: The Fellowship of the Ring","plot":"A meek hobbit of the Shire and eight companions set out on a journey to Mount Doom to destroy the One Ring and the dark lord Sauron.","year":"2001"},{"title":"Star Wars: Episode V - The Empire Strikes Back","plot":"After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.","year":"1980"},{"title":"Inception","plot":"A skilled extractor is offered a chance to regain his old life as payment for a task considered to be impossible.","year":"2010"},{"title":"Forrest Gump","plot":"Forrest Gump, while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran, eludes him.","year":"1994"},{"title":"One Flew Over the Cuckoo's Nest","plot":"Upon admittance to a mental institution, a brash rebel rallies the patients to take on the oppressive head nurse.","year":"1975"},{"title":"The Lord of the Rings: The Two Towers","plot":"While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.","year":"2002"},{"title":"Goodfellas","plot":"Henry Hill and his friends work their way up through the mob hierarchy.","year":"1990"},{"title":"Star Wars: Episode IV - A New Hope","plot":"Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a wookiee and two droids to save the universe from the Empire's world-destroying battle-station, while also attempting to rescue Princess Leia from the evil Darth Vader.","year":"1977"},{"title":"The Matrix","plot":"A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.","year":"1999"},{"title":"Seven Samurai","plot":"A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves.","year":"1954"},{"title":"City of God","plot":"Two boys growing up in a violent neighborhood of Rio de Janeiro take different paths: one becomes a photographer, the other a drug dealer.","year":"2002"},{"title":"Se7en","plot":"Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his modus operandi.","year":"1995"},{"title":"The Usual Suspects","plot":"A boat has been destroyed, criminals are dead, and the key to this mystery lies with the only survivor and his twisted, convoluted story beginning with five career crooks in a seemingly random police lineup.","year":"1995"},{"title":"The Silence of the Lambs","plot":"A young F.B.I. cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims.","year":"1991"},{"title":"Once Upon a Time in the West","plot":"Epic story of a mysterious stranger with a harmonica who joins forces with a notorious desperado to protect a beautiful widow from a ruthless assassin working for the railroad.","year":"1968"},{"title":"It's a Wonderful Life","plot":"An angel helps a compassionate but despairingly frustrated businessman by showing what life would have been like if he never existed.","year":"1946"},{"title":"L\\u00e9on: The Professional","plot":"A professional assassin rescues a young girl whose family were killed in a police raid.","year":"1994"},{"title":"Casablanca","plot":"Set in unoccupied Africa during the early days of World War II: An American expatriate meets a former lover, with unforeseen complications.","year":"1942"},{"title":"Life Is Beautiful","plot":"A Jewish man has a wonderful romance with the help of his humour, but must use that same quality to protect his son in a Nazi death camp.","year":"1997"},{"title":"Raiders of the Lost Ark","plot":"Archeologist and adventurer Indiana Jones is hired by the US government to find the Ark of the Covenant before the Nazis.","year":"1981"},{"title":"American History X","plot":"A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.","year":"1998"},{"title":"Psycho","plot":"A Phoenix secretary steals $40,000 from her employer's client, goes on the run and checks into a remote motel run by a young man under the domination of his mother.","year":"1960"},{"title":"Rear Window","plot":"A wheelchair bound photographer spies on his neighbours from his apartment window and becomes convinced one of them has committed murder.","year":"1954"},{"title":"Jaws","plot":"When a gigantic great white shark begins to menace the small island community of Amity, a police chief, a marine scientist and grizzled fisherman set out to stop it.","year":"1975"},{"title":"Infernal Affairs","plot":"A story between a mole in the police department and an undercover cop. Their objectives are the same: to find out who is the mole, and who is the cop.","year":"2002"},{"title":"Nausica\\u00e4 of the Valley of the Wind","plot":"Warrior/pacifist Princess Nausica\\u00e4 desperately struggles to prevent two warring nations from destroying themselves and their dying planet.","year":"1984"},{"title":"Twelve Monkeys","plot":"In a future world devastated by disease, a convict is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet.","year":"1995"},{"title":"Fanny and Alexander","plot":"Two young Swedish children experience the many comedies and tragedies of their family, the Ekdahls.","year":"1982"},{"title":"The Terminator","plot":"A human-looking indestructible cyborg is sent from 2029 to 1984 to assassinate a waitress, whose unborn son will lead humanity in a war against the machines, while a soldier from that war is sent to protect her at all costs.","year":"1984"},{"title":"The Road","plot":"A care-free girl is sold to a traveling entertainer, consequently enduring physical and emotional pain along the way.","year":"1954"},{"title":"Ip Man","plot":"A semi-biographical account of Yip Man, the first martial arts master to teach the Chinese martial art of Wing Chun.","year":"2008"},{"title":"Stalker","plot":"A guide leads two men through an area known as the Zone to find a room that grants wishes.","year":"1979"},{"title":"The Night of the Hunter","plot":"A religious fanatic marries a gullible widow whose young children are reluctant to tell him where their real daddy hid $10,000 he'd stolen in a robbery.","year":"1955"},{"title":"Lagaan: Once Upon a Time in India","plot":"The people of a small village in Victorian India stake their future on a game of cricket against their ruthless British rulers...","year":"2001"},{"title":"Groundhog Day","plot":"A weatherman finds himself living the same day over and over again.","year":"1993"},{"title":"Harry Potter and the Deathly Hallows: Part 2","plot":"Harry, Ron and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts.","year":"2011"},{"title":"Rocky","plot":"Rocky Balboa, a small-time boxer gets a supremely rare chance to fight the heavy-weight champion, Apollo Creed, in a bout in which he strives to go the distance for his self-respect.","year":"1976"},{"title":"Dog Day Afternoon","plot":"A man robs a bank to pay for his lover's operation; it turns into a hostage situation and a media circus.","year":"1975"},{"title":"Captain America: The Winter Soldier","plot":"Steve Rogers struggles to embrace his role in the modern world and battles a new threat from old history: the Soviet agent known as the Winter Soldier.","year":"2014"},{"title":"Who's Afraid of Virginia Woolf?","plot":"A bitter aging couple with the help of alcohol, use a young couple to fuel anguish and emotional pain towards each other.","year":"1966"},{"title":"Shutter Island","plot":"In 1954, U.S. Marshal Teddy Daniels is investigating the disappearance of a murderess who escaped from a hospital for the criminally insane and is presumed to be hiding nearby.","year":"2010"},{"title":"La Haine","plot":"After local youth Abdel is beaten unconscious by police, a riot ensues on his estate during which a policeman loses his gun. The gun is found by Vinz who threatens he will kill a cop if Abdel dies.","year":"1995"},{"title":"The Big Sleep","plot":"Private detective Philip Marlowe is hired by a rich family. Before the complex case is over, he's seen murder, blackmail, and what might be love.","year":"1946"},{"title":"The Battle of Algiers","plot":"In the 1950s, fear and violence escalate as the people of Algiers fight for independence from the French government.","year":"1966"},{"title":"Pirates of the Caribbean: The Curse of the Black Pearl","plot":"Blacksmith Will Turner teams up with eccentric pirate \"Captain\" Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead.","year":"2003"},{"title":"Before Sunrise","plot":"A young man and woman meet on a train in Europe, and wind up spending one evening together in Vienna. Unfortunately, both know that this will probably be their only night together.","year":"1995"},{"title":"Barry Lyndon","plot":"An Irish rogue wins the heart of a rich widow and assumes her dead husband's aristocratic position in 18th-century England.","year":"1975"},{"title":"Monsters, Inc.","plot":"Monsters generate their city's power by scaring children, but they are terribly afraid themselves of being contaminated by children, so when one enters Monstropolis, top scarer Sulley finds his world disrupted.","year":"2001"},{"title":"Gravity","plot":"A medical engineer and an astronaut work together to survive after a catastrophe destroys their shuttle and leaves them adrift in orbit.","year":"2013"},{"title":"The Graduate","plot":"Recent college graduate Benjamin Braddock is trapped into an affair with Mrs. Robinson, who happens to be the wife of his father's business partner and then finds himself falling in love with her daughter, Elaine.","year":"1967"},{"title":"Memories of Murder","plot":"In 1986, in the province of Gyunggi, in South Korea, a second young and beautiful woman is found dead, raped and tied and gagged with her underwear. Detective Park Doo-Man and Detective Cho... See full summary \\u00a0\\u00bb","year":"2003"},{"title":"Castle in the Sky","plot":"A young boy and a girl with a magic crystal must race against pirates and foreign agents in a search for a legendary floating castle.","year":"1986"},{"title":"The Hustler","plot":"An up-and-coming pool player plays a long-time champion in a single high-stakes match.","year":"1961"},{"title":"Roman Holiday","plot":"A bored and sheltered princess escapes her guardians and falls in love with an American newsman in Rome.","year":"1953"},{"title":"The Celebration","plot":"At Helge's 60th birthday party, some unpleasant family truths are revealed.","year":"1998"},{"title":"A Fistful of Dollars","plot":"A wandering gunfighter plays two rival families against each other in a town torn apart by greed, pride, and revenge.","year":"1964"},{"title":"The Help","plot":"An aspiring author during the civil rights movement of the 1960s decides to write a book detailing the African-American maids' point of view on the white families for which they work, and the hardships they go through on a daily basis.","year":"2011"},{"title":"In the Mood for Love","plot":"A man and a woman move in to neighboring Hong Kong apartments and form a bond when they both suspect their spouses of extramarital activities.","year":"2000"},{"title":"A Christmas Story","plot":"Ralphie has to convince his parents, his teacher, and Santa that a Red Ryder B.B. gun really is the perfect gift for the 1940s.","year":"1983"},{"title":"Slumdog Millionaire","plot":"A Mumbai teen who grew up in the slums, becomes a contestant on the Indian version of \"Who Wants To Be A Millionaire?\" He is arrested under suspicion of cheating, and while being interrogated, events from his life history are shown which explain why he knows the answers.","year":"2008"},{"title":"Stalag 17","plot":"When two escaping American World War II prisoners are killed, the German POW camp barracks black marketeer, J.J. Sefton, is suspected of being an informer.","year":"1953"},{"title":"The Truman Show","plot":"An insurance salesman/adjuster discovers his entire life is actually a T.V. show.","year":"1998"},{"title":"Swades","plot":"A successful Indian scientist returns to an Indian village to take his nanny to America with him and in the process rediscovers his roots.","year":"2004"},{"title":"Underground","plot":"The story follows an underground weapons manufacturer in Belgrade during WWII and evolves into fairly surreal situations. A black marketeer who smuggles the weapons to partisans doesn't ... See full summary \\u00a0\\u00bb","year":"1995"},{"title":"Rope","plot":"Two young men strangle their \"inferior\" classmate, hide his body in their apartment, and invite his friends and family to a dinner party as a means to challenge the \"perfection\" of their crime.","year":"1948"},{"title":"The Killing","plot":"Crooks plan and execute a daring race-track robbery.","year":"1956"},{"title":"Elite Squad: The Enemy Within","plot":"After a prison riot, former-Captain Nascimento, now a high ranking security officer in Rio de Janeiro, is swept into a bloody political dispute that involves government officials and paramilitary groups.","year":"2010"},{"title":"Beauty and the Beast","plot":"Belle, whose father is imprisoned by the Beast, offers herself instead and discovers her captor to be an enchanted prince.","year":"1991"},{"title":"Jurassic Park","plot":"During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok.","year":"1993"},{"title":"Black Swan","plot":"A ballet dancer wins the lead in \"Swan Lake\" and is perfect for the role of the delicate White Swan - Princess Odette - but slowly loses her mind as she becomes more and more like Odile, the Black Swan.","year":"2010"},{"title":"Three Colors: Red","plot":"Final entry in a trilogy of films dealing with contemporary French society concerns a model who discovers her neighbour is keen on invading people's privacy.","year":"1994"},{"title":"The Diving Bell and the Butterfly","plot":"The true story of Elle editor Jean-Dominique Bauby who suffers a stroke and has to live with an almost totally paralyzed body; only his left eye isn't paralyzed.","year":"2007"},{"title":"Blood Diamond","plot":"A fisherman, a smuggler, and a syndicate of businessmen match wits over the possession of a priceless diamond.","year":"2006"}]}